from All_utils_project.data.emojies import Emo


txt = (f'Привет!{Emo.just_smile}\n\n'
	   f'Ты проходил Лингвистику и интересовался Кошкой{Emo.heart}\n'
	   f'(моим курсом Доброе слово для кошки{Emo.hand_over_mouth})\n\n'
	   f'Напоминаю, 30 ноября старт очередного потока\n'
	   f'Буду рада видеть тебя в группе!{Emo.hugs}\n\n'
	   f'Давай вместе создавать новые горизонты мышления!{Emo.heart}\n'
	   f'https://fillatova.ru')


# text = (
# 	f'Приветствую! Меня зовут Филатова Ирина, я тренер Лингвистики, соавтор одноименной книги)) {emoj(Emo.hugs)}\n\n'
# 	f'Лингвистика - очень объёмный и сложный тренинг, и я его бесконечно люблю {emoj(Emo.heart)}\n\n'
# 	f'При этом, тема комплиментов раскрыта в нём, на мой взгляд, не полностью {emoj(Emo.omg_cat_face)}\n'
# 	f'А ведь это один из важнейших навыков для установления раппорта {emoj(Emo.red_exclamation)}\n\n'
# 	f'30 ноября стартует мой авторский онлайн курс "Доброе слово для кошки" {emoj(Emo.hand_over_mouth)}\n\n'
# 	f'На нём мы разберём не только, что говорить и как говорить, '
# 	f'но и психо-физиологические основы этого процесса {emoj(Emo.nerd_face)}\n\n'
# 	f'Комплименты в зависимости от цели (для разного уровня раппорта)\n\n'
# 	f'2 лекционных вебинара в неделю, и 3 встречи обратной связи.'
# 	f' Запись будет, будет чат, в котором я так же буду отвечать на вопросы {emoj(Emo.big_smile)}\n\n'
# 	f'Записаться, ознакомиться подробнее тут https://fillatova.ru\n'
# 	f'Price = 7000{Emo.ruble}\n\n'
# 	f'Там есть даже подробный mindmap, где возле вкладок есть цифры - сколько ещё подвкладок {emoj(Emo.explosive_head)}\n\n'
# 	f'Присоединяйся! Давай вместе создавать новые горизонты мышления! {emoj(Emo.sunglasses)}')
