all_styles = [
    '- с головой над водой',
    '- 4/6 ударов ногами на спине/переворот/на животе/переворот',
    '- на руках (с доской в бёдрах/коленях/щиколотках)',
    '- на ногах',
    '- на боку',
    '- руки за спиной в замке',
    '- на 1й руке',
    '- проныры',
    '- наименьшее количество гребков',
    '- культя, руку складываешь пальцами касаешься плеча, на одной руке, можно и на двух',
    '- скольжение руки вдоль туловища',
    '- правой/левой/двумя',
    '- в футболке',
    '- с парашютом',
    '- с ногами в мешках',
    '- на боку на прямых ногах с максимальной амплитудой',
    '- вперед ногами руки у бёдер',
    '- вперед ногами руки за головой',
]

free_style = [
    '- в кулачках',
    '- захват',
    '- кулачок и лопатка',
    '- толчок',
    '- 6-1-6 6-3-6 **',
    '- мачта на боку',
    '- пронос/высокий локоть **',
    '- эстафета **',
    '- обратная эстафета (руки возле бёдер)',
    '- дирижёр',
    '- захват и толчок без проноса',
    '- в координации + высокий локоть на 3й гребок',
    '- ориентирование (поднимать голову через 2 цикла, смотреть куда гребёшь)',
    '- супермен (1 рука вперед, смена рук мельницей)',
    '- в стрелочке пронос прямой рукой через верх со вдохом без гребков в ластах',
    '- кроль-батт',
    '- 50м плывёшь 20 на резине',
    '- пароход (на одной ноге, вторая согнута под 90 в колене, в руках доска)',
    '- на ногах 1 рука впереди',
    '- мельница **',
    '- ногами вперёд',
    '- на руках с колобашкой на щиколотках',
    '- гребок 1й вторая прижата (отделять гребок от вдоха, во время вдоха 1я рука вытянута вперёд)',
    '- пистолет (гребок со вдохом, руку согнутой оставляем вверху на 6 ударов ногами, смена рук)',
]

backstroke_constants = 'самая плотная вода - самая глубокая' \
                 'доводить ротацию корпуса до 90 градусов' \
                 'первым номером работают плечи' \
                 'оба плеча и локоть - одна линия' \
                 'рука должна свободно падать в воду' \
                 'подвернуть таз' \
                 'в конце 2й начале 3й фазы гребка локоть не касается бока, остаётся щель с кулак шириной' \
                 'если округлиться, то гребок короче, но плотнее' \
                 'руки в обяз одновременно, нельзя заканчивать гребок раньше входа верхней руки в воду' \
                 'без перепрогиба в спине' \
                 'завершение гребка должно совпадать с выходом таза в горизонтальную плоскость' \
                 'когда руки находятся под 90 к плоскости воды нижнюю топим верхнюю тянем ввысь, место для ротации'

backstroke = [
    '- на ногах руки вдоль туловища, топим подбородок, чтобы поднялась грудь над водой',
    '- культя, пальцами касаешься плеча, гребешь на одной руке, можно и на двух',
    '- на ногах 2 руки под 90',
    '- мачта',
    '- 3 скаллинга в 1й фазе, 3 во 2й, 3 хлыста в 3й, 3 гребка, на 1й руке делается',
    '- скаллинг в фазе захвата на 1й руке',
    '- скаллинг в фазе средней на 1й руке',
    '- фаза догребания на 1й руке (рука должна как винт крутиться, "сбрасывать")',
    '- одна рука в культе, второй вначале ставишь "лопату (начало захвата)" потом гребок',
    '- подбородок прижат, пресс скручен, как будто сидишь, 15 метров на максимум',
    '- подбородок прижат, пресс скручен, как будто сидишь, 10 метров, потом голову вернуть на воду, тело оставить',
    '- 3 гребка на 1й руке, затем по 2 гребка в полной координации',
    '- одна рука вытянута вперед гребёт только вторая',
    '- ласты 1 рука под 90 вторая гребёт, верхняя рука - маркер для разворота плеч',
    '- свободно ронять руку в конце гребка',
    '- одновременная встречная смена рук через верх без гребков',
    '- подъем мачты на 6 ударов ногами, вторая рука вдоль туловища или в стрелочке',
    '- на 1й руке **',
    '- эстафета **',
    '- обратная эстафета (руки возле бёдер)',
    '- пронос **',
    '- 6-1-6 (перекат, перекат с напряжённой рукой)',
    '- эстафета + пронос',
    '- 1й рукой + высокое плечо',
    '- перекаты на бок через спину',
    '- рука за головой второй гребки',
    '- руки вдоль туловища гребки через 6 ударов ногами',
    '- шторм (на ногах плывёшь доску поднимаешь-опускаешь от ног до головы на 2,3,4.. ударов ногами)',
    '- гребок 1й вторая прижата',
    '- пистолет на спине (вторая вытянута вперед, гребок и зафиксировать руку под 90 вверх, '
    '- 6 ударов, гребок другой, первую вперед вытянул)',
    '- мельница (смена рук через 6 ударов)',
    '- в координации с пронырами (с пронырами с 1й рукой)',
    # '- толкач (толкать головой партнёра)',
]

butterfly_stroke = [
    '- подводная часть гребка + удар + вдох + удар',
    '- склаллинг (руки вперед вытянул, опору на воду чувствуешь) 2 удара, вдох+удар, вход в воду+удар',
    '- на координацию (вдох/подводная часть гребка/2 удара/вдох + пронос 1й руки/2 удара/вдох + пронос 2 руки/2 удара)',
    '- гребок со вдохом вперед + на бок',
    '- ноги кроль руки батт',
    '- ноги батт руки брасс',
    '- обратный дельфин (на спине)',
    '- гребок с обратным проносом',
    '- батт на координацию вдох через 1,2,3.. гребка',
    '- на наименьшее количество гребков',
    '- захват',
    '- толчок',
    '- дирижёр',
    '- захват и толчок без проноса',
    '- кроль-батт',
    '- 50м плывёшь 20 на резине',
    '- правой/левой/двумя',
]

for i in backstroke:
    print(i)
breast_stroke = [
    '- 2 гребка руками 1 ногами',
    '- 2 гребка ногами 1 руками',
    '- ноги кроль/батт руки брасс',
    '- на ногах с резинкой на коленях, чтоб ноги не расходились',
    '- попеременная работа ногами (ватерпольный жим)',
    '- поочерёдные гребки руками',
    '- по диагонали рукой держать ногу за спиной, плыть на 1й руке и 1й ноге',
]

all_exercises = butterfly_stroke + backstroke + breast_stroke + free_style + all_styles
all_exercises_list = [all_styles, butterfly_stroke, backstroke, breast_stroke, free_style, all_exercises]
